; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__uclibc_locale_struct.193 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.192 }
%struct.__collate_t.192 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.560 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.560*, [2 x i32], %struct.timezone, i8* }
%struct.timezone = type { i32, i32 }
%struct.exe_file_t = type { i32, i32, i64, %struct.exe_disk_file_t* }
%struct.exe_disk_file_t = type { i32, i8*, %struct.stat64* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "llvm-9/llvm-src/build/lib/clang/9.0.0/include/stddef.h", directory: "/home/haoxin/disk-smu/research/klee-env")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 297, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 296, type: !55, scopeLine: 296, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/haoxin/disk-smu/research/klee-ccured")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/POSIX/fd.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 46, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/haoxin/disk-smu/research/klee-ccured")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "eReadable", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "eWriteable", value: 8, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!76 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!79 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 93, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 141, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 137, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 46, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 48, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 133, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 53, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 136, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 61, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 139, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 62, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 138, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 64, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 134, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 65, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 135, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 67, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 69, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 74, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 140, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 78, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 162, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 80, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 167, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 91, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 9, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 11, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 148, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 12, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 184, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 92, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 93, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 106, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !149, !156, !162, !167, !172}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 329, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 328, type: !143, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !147}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 109, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 181, baseType: !81)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 46, baseType: !10)
!148 = !DIFile(filename: "packages/llvm-10.0-obj/lib/clang/10.0.0/include/stddef.h", directory: "/home/haoxin/disk-smu/research")
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "n_calls", scope: !151, file: !54, line: 395, type: !45, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 394, type: !152, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!145, !45, !154, !147}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "n_calls", scope: !158, file: !54, line: 626, type: !45, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 625, type: !159, scopeLine: 625, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!159 = !DISubroutineType(types: !160)
!160 = !{!45, !29, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 70, baseType: !112)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "n_calls", scope: !164, file: !54, line: 645, type: !45, isLocal: true, isDefinition: true)
!164 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 644, type: !165, scopeLine: 644, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!165 = !DISubroutineType(types: !166)
!166 = !{!45, !45, !161}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "n_calls", scope: !169, file: !54, line: 731, type: !45, isLocal: true, isDefinition: true)
!169 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 730, type: !170, scopeLine: 730, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!170 = !DISubroutineType(types: !171)
!171 = !{!45, !45, !82}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "n_calls", scope: !174, file: !54, line: 1307, type: !45, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1306, type: !175, scopeLine: 1306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!175 = !DISubroutineType(types: !176)
!176 = !{!7, !7, !147}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !179, file: !192, line: 375, type: !432, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !181, globals: !234, nameTableKind: None)
!180 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!181 = !{!45, !182, !7, !183, !185, !188, !96, !189, !190, !203, !211, !10}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!188 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !192, line: 400, baseType: !193)
!192 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 390, size: 128, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !193, file: !192, line: 391, baseType: !187, size: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !193, file: !192, line: 392, baseType: !187, size: 16, offset: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !193, file: !192, line: 393, baseType: !187, size: 16, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !193, file: !192, line: 394, baseType: !187, size: 16, offset: 48)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !193, file: !192, line: 396, baseType: !187, size: 16, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !193, file: !192, line: 397, baseType: !187, size: 16, offset: 80)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !193, file: !192, line: 398, baseType: !187, size: 16, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !193, file: !192, line: 399, baseType: !187, size: 16, offset: 112)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !192, line: 430, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 425, size: 64, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !205, file: !192, line: 426, baseType: !187, size: 16)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !205, file: !192, line: 427, baseType: !187, size: 16, offset: 16)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !205, file: !192, line: 428, baseType: !187, size: 16, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !205, file: !192, line: 429, baseType: !187, size: 16, offset: 48)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !192, line: 423, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 402, size: 304, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !213, file: !192, line: 403, baseType: !187, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !213, file: !192, line: 404, baseType: !187, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !213, file: !192, line: 405, baseType: !187, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !213, file: !192, line: 406, baseType: !187, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !213, file: !192, line: 407, baseType: !187, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !213, file: !192, line: 408, baseType: !187, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !213, file: !192, line: 409, baseType: !187, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !213, file: !192, line: 410, baseType: !187, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !213, file: !192, line: 411, baseType: !187, size: 16, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !213, file: !192, line: 412, baseType: !187, size: 16, offset: 144)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !213, file: !192, line: 413, baseType: !187, size: 16, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !213, file: !192, line: 414, baseType: !187, size: 16, offset: 176)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !213, file: !192, line: 415, baseType: !187, size: 16, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !213, file: !192, line: 416, baseType: !187, size: 16, offset: 208)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !213, file: !192, line: 418, baseType: !187, size: 16, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !213, file: !192, line: 419, baseType: !187, size: 16, offset: 240)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !213, file: !192, line: 420, baseType: !187, size: 16, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !213, file: !192, line: 421, baseType: !187, size: 16, offset: 272)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !213, file: !192, line: 422, baseType: !187, size: 16, offset: 288)
!234 = !{!235, !420, !177, !422, !425, !427}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "__global_locale", scope: !179, file: !192, line: 377, type: !237, isLocal: false, isDefinition: true)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !238, line: 330, baseType: !239)
!238 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !238, line: 154, size: 26560, elements: !241)
!241 = !{!242, !249, !255, !256, !260, !262, !263, !267, !271, !273, !274, !275, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !294, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !240, file: !238, line: 156, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !246, line: 38, baseType: !247)
!246 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !248, line: 44, baseType: !94)
!248 = !DIFile(filename: "./include/bits/types.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !240, file: !238, line: 157, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !246, line: 42, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !248, line: 43, baseType: !254)
!254 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !240, file: !238, line: 158, baseType: !250, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !240, file: !238, line: 162, baseType: !257, size: 6144, offset: 192)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 6144, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !240, file: !238, line: 163, baseType: !261, size: 6144, offset: 6336)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 6144, elements: !258)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !240, file: !238, line: 164, baseType: !261, size: 6144, offset: 12480)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !240, file: !238, line: 168, baseType: !264, size: 112, offset: 18624)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 14)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !240, file: !238, line: 174, baseType: !268, size: 96, offset: 18736)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 96, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 6)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !240, file: !238, line: 175, baseType: !272, size: 48, offset: 18832)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !269)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !240, file: !238, line: 178, baseType: !96, size: 8, offset: 18880)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !240, file: !238, line: 179, baseType: !96, size: 8, offset: 18888)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !240, file: !238, line: 180, baseType: !276, size: 80, offset: 18896)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 80, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 10)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !240, file: !238, line: 183, baseType: !183, size: 64, offset: 19008)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !240, file: !238, line: 184, baseType: !183, size: 64, offset: 19072)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !240, file: !238, line: 185, baseType: !183, size: 64, offset: 19136)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !240, file: !238, line: 186, baseType: !183, size: 64, offset: 19200)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !240, file: !238, line: 188, baseType: !183, size: 64, offset: 19264)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !240, file: !238, line: 189, baseType: !185, size: 64, offset: 19328)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !240, file: !238, line: 190, baseType: !183, size: 64, offset: 19392)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !240, file: !238, line: 191, baseType: !183, size: 64, offset: 19456)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !240, file: !238, line: 197, baseType: !185, size: 64, offset: 19520)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !240, file: !238, line: 199, baseType: !183, size: 64, offset: 19584)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !240, file: !238, line: 200, baseType: !183, size: 64, offset: 19648)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !240, file: !238, line: 202, baseType: !291, size: 64, offset: 19712)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !254)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !240, file: !238, line: 205, baseType: !295, size: 32, offset: 19776)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !240, file: !238, line: 206, baseType: !295, size: 32, offset: 19808)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !240, file: !238, line: 207, baseType: !45, size: 32, offset: 19840)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !240, file: !238, line: 208, baseType: !45, size: 32, offset: 19872)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !240, file: !238, line: 213, baseType: !29, size: 64, offset: 19904)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !240, file: !238, line: 214, baseType: !29, size: 64, offset: 19968)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !240, file: !238, line: 215, baseType: !29, size: 64, offset: 20032)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !240, file: !238, line: 216, baseType: !29, size: 64, offset: 20096)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !240, file: !238, line: 217, baseType: !29, size: 64, offset: 20160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !240, file: !238, line: 218, baseType: !29, size: 64, offset: 20224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !240, file: !238, line: 219, baseType: !29, size: 64, offset: 20288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !240, file: !238, line: 220, baseType: !29, size: 64, offset: 20352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !240, file: !238, line: 221, baseType: !29, size: 64, offset: 20416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !240, file: !238, line: 222, baseType: !29, size: 64, offset: 20480)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !240, file: !238, line: 223, baseType: !29, size: 64, offset: 20544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !240, file: !238, line: 226, baseType: !29, size: 64, offset: 20608)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !240, file: !238, line: 227, baseType: !29, size: 64, offset: 20672)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !240, file: !238, line: 228, baseType: !29, size: 64, offset: 20736)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !240, file: !238, line: 231, baseType: !29, size: 64, offset: 20800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !240, file: !238, line: 232, baseType: !29, size: 64, offset: 20864)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !240, file: !238, line: 233, baseType: !29, size: 64, offset: 20928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !240, file: !238, line: 234, baseType: !29, size: 64, offset: 20992)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !240, file: !238, line: 235, baseType: !29, size: 64, offset: 21056)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !240, file: !238, line: 236, baseType: !29, size: 64, offset: 21120)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !240, file: !238, line: 237, baseType: !29, size: 64, offset: 21184)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !240, file: !238, line: 238, baseType: !29, size: 64, offset: 21248)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !240, file: !238, line: 239, baseType: !29, size: 64, offset: 21312)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !240, file: !238, line: 240, baseType: !29, size: 64, offset: 21376)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !240, file: !238, line: 241, baseType: !29, size: 64, offset: 21440)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !240, file: !238, line: 242, baseType: !29, size: 64, offset: 21504)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !240, file: !238, line: 243, baseType: !29, size: 64, offset: 21568)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !240, file: !238, line: 244, baseType: !29, size: 64, offset: 21632)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !240, file: !238, line: 245, baseType: !29, size: 64, offset: 21696)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !240, file: !238, line: 246, baseType: !29, size: 64, offset: 21760)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !240, file: !238, line: 247, baseType: !29, size: 64, offset: 21824)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !240, file: !238, line: 248, baseType: !29, size: 64, offset: 21888)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !240, file: !238, line: 249, baseType: !29, size: 64, offset: 21952)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !240, file: !238, line: 250, baseType: !29, size: 64, offset: 22016)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !240, file: !238, line: 251, baseType: !29, size: 64, offset: 22080)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !240, file: !238, line: 253, baseType: !29, size: 64, offset: 22144)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !240, file: !238, line: 256, baseType: !29, size: 64, offset: 22208)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !240, file: !238, line: 257, baseType: !29, size: 64, offset: 22272)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !240, file: !238, line: 258, baseType: !29, size: 64, offset: 22336)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !240, file: !238, line: 259, baseType: !29, size: 64, offset: 22400)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !240, file: !238, line: 260, baseType: !29, size: 64, offset: 22464)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !240, file: !238, line: 261, baseType: !29, size: 64, offset: 22528)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !240, file: !238, line: 262, baseType: !29, size: 64, offset: 22592)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !240, file: !238, line: 264, baseType: !29, size: 64, offset: 22656)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !240, file: !238, line: 265, baseType: !29, size: 64, offset: 22720)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !240, file: !238, line: 266, baseType: !29, size: 64, offset: 22784)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !240, file: !238, line: 267, baseType: !29, size: 64, offset: 22848)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !240, file: !238, line: 268, baseType: !29, size: 64, offset: 22912)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !240, file: !238, line: 269, baseType: !29, size: 64, offset: 22976)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !240, file: !238, line: 270, baseType: !29, size: 64, offset: 23040)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !240, file: !238, line: 272, baseType: !29, size: 64, offset: 23104)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !240, file: !238, line: 273, baseType: !29, size: 64, offset: 23168)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !240, file: !238, line: 274, baseType: !29, size: 64, offset: 23232)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !240, file: !238, line: 275, baseType: !29, size: 64, offset: 23296)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !240, file: !238, line: 276, baseType: !29, size: 64, offset: 23360)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !240, file: !238, line: 277, baseType: !29, size: 64, offset: 23424)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !240, file: !238, line: 278, baseType: !29, size: 64, offset: 23488)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !240, file: !238, line: 279, baseType: !29, size: 64, offset: 23552)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !240, file: !238, line: 280, baseType: !29, size: 64, offset: 23616)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !240, file: !238, line: 281, baseType: !29, size: 64, offset: 23680)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !240, file: !238, line: 282, baseType: !29, size: 64, offset: 23744)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !240, file: !238, line: 283, baseType: !29, size: 64, offset: 23808)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !240, file: !238, line: 285, baseType: !29, size: 64, offset: 23872)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !240, file: !238, line: 286, baseType: !29, size: 64, offset: 23936)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !240, file: !238, line: 287, baseType: !29, size: 64, offset: 24000)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !240, file: !238, line: 288, baseType: !29, size: 64, offset: 24064)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !240, file: !238, line: 289, baseType: !29, size: 64, offset: 24128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !240, file: !238, line: 290, baseType: !29, size: 64, offset: 24192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !240, file: !238, line: 291, baseType: !29, size: 64, offset: 24256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !240, file: !238, line: 292, baseType: !29, size: 64, offset: 24320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !240, file: !238, line: 293, baseType: !29, size: 64, offset: 24384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !240, file: !238, line: 294, baseType: !29, size: 64, offset: 24448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !240, file: !238, line: 295, baseType: !29, size: 64, offset: 24512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !240, file: !238, line: 296, baseType: !29, size: 64, offset: 24576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !240, file: !238, line: 298, baseType: !29, size: 64, offset: 24640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !240, file: !238, line: 299, baseType: !29, size: 64, offset: 24704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !240, file: !238, line: 301, baseType: !29, size: 64, offset: 24768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !240, file: !238, line: 302, baseType: !29, size: 64, offset: 24832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !240, file: !238, line: 303, baseType: !29, size: 64, offset: 24896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !240, file: !238, line: 304, baseType: !29, size: 64, offset: 24960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !240, file: !238, line: 305, baseType: !29, size: 64, offset: 25024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !240, file: !238, line: 307, baseType: !29, size: 64, offset: 25088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !240, file: !238, line: 308, baseType: !29, size: 64, offset: 25152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !240, file: !238, line: 309, baseType: !29, size: 64, offset: 25216)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !240, file: !238, line: 310, baseType: !29, size: 64, offset: 25280)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !240, file: !238, line: 311, baseType: !29, size: 64, offset: 25344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !240, file: !238, line: 316, baseType: !29, size: 64, offset: 25408)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !240, file: !238, line: 317, baseType: !29, size: 64, offset: 25472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !240, file: !238, line: 318, baseType: !29, size: 64, offset: 25536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !240, file: !238, line: 319, baseType: !29, size: 64, offset: 25600)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !240, file: !238, line: 322, baseType: !390, size: 896, offset: 25664)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !238, line: 149, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 111, size: 896, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !418, !419}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !391, file: !238, line: 112, baseType: !187, size: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !391, file: !238, line: 113, baseType: !187, size: 16, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !391, file: !238, line: 114, baseType: !187, size: 16, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !391, file: !238, line: 115, baseType: !187, size: 16, offset: 48)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !391, file: !238, line: 116, baseType: !187, size: 16, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !391, file: !238, line: 117, baseType: !187, size: 16, offset: 80)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !391, file: !238, line: 118, baseType: !187, size: 16, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !391, file: !238, line: 119, baseType: !187, size: 16, offset: 112)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !391, file: !238, line: 120, baseType: !187, size: 16, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !391, file: !238, line: 121, baseType: !187, size: 16, offset: 144)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !391, file: !238, line: 122, baseType: !187, size: 16, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !391, file: !238, line: 123, baseType: !187, size: 16, offset: 176)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !391, file: !238, line: 124, baseType: !187, size: 16, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !391, file: !238, line: 125, baseType: !187, size: 16, offset: 208)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !391, file: !238, line: 127, baseType: !187, size: 16, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !391, file: !238, line: 128, baseType: !187, size: 16, offset: 240)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !391, file: !238, line: 130, baseType: !185, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !391, file: !238, line: 131, baseType: !185, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !391, file: !238, line: 132, baseType: !185, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !391, file: !238, line: 135, baseType: !185, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !391, file: !238, line: 138, baseType: !185, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !391, file: !238, line: 141, baseType: !185, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !391, file: !238, line: 142, baseType: !185, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !391, file: !238, line: 145, baseType: !417, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !391, file: !238, line: 146, baseType: !417, size: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !391, file: !238, line: 148, baseType: !187, size: 16, offset: 832)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !179, file: !192, line: 380, type: !237, isLocal: false, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "utf8", scope: !179, file: !192, line: 387, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !269)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "ascii", scope: !179, file: !192, line: 388, type: !424, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "__code2flag", scope: !179, file: !192, line: 854, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 256, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 16)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !238, line: 324, baseType: !240)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "stdin", scope: !435, file: !436, line: 154, type: !440, isLocal: false, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !437, nameTableKind: None)
!436 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!437 = !{!433, !438, !470, !472, !474, !476, !478}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "stdout", scope: !435, file: !436, line: 155, type: !440, isLocal: false, isDefinition: true)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !442, line: 46, baseType: !443)
!442 = !DIFile(filename: "./include/stdio.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !444, line: 233, size: 704, elements: !445)
!444 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!445 = !{!446, !447, !451, !452, !453, !454, !455, !456, !457, !458, !460, !462, !469}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !443, file: !444, line: 234, baseType: !94, size: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !443, file: !444, line: 237, baseType: !448, size: 16, offset: 16)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 2)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !443, file: !444, line: 244, baseType: !45, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !443, file: !444, line: 246, baseType: !189, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !443, file: !444, line: 247, baseType: !189, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !443, file: !444, line: 248, baseType: !189, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !443, file: !444, line: 249, baseType: !189, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !443, file: !444, line: 252, baseType: !189, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !443, file: !444, line: 255, baseType: !189, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !443, file: !444, line: 261, baseType: !459, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !443, file: !444, line: 268, baseType: !461, size: 64, offset: 512)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !449)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !443, file: !444, line: 271, baseType: !463, size: 64, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !464, line: 85, baseType: !465)
!464 = !DIFile(filename: "./include/wchar.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 81, size: 64, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !465, file: !464, line: 83, baseType: !295, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !465, file: !464, line: 84, baseType: !295, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !443, file: !444, line: 274, baseType: !6, size: 64, offset: 640)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "stderr", scope: !435, file: !436, line: 156, type: !440, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "__stdin", scope: !435, file: !436, line: 159, type: !440, isLocal: false, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "__stdout", scope: !435, file: !436, line: 162, type: !440, isLocal: false, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !435, file: !436, line: 180, type: !440, isLocal: false, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !435, file: !436, line: 131, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 2112, elements: !137)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !483, file: !484, line: 49, type: !45, isLocal: true, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !485, globals: !499, nameTableKind: None)
!484 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!485 = !{!486, !6, !495}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !488, line: 50, baseType: !489)
!488 = !DIFile(filename: "./include/signal.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !490, line: 31, baseType: !491)
!490 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 28, size: 1024, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !491, file: !490, line: 30, baseType: !494, size: 1024)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !430)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !488, line: 75, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !45}
!499 = !{!481}
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !502, file: !505, line: 309, type: !496, isLocal: false, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !504, nameTableKind: None)
!503 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!504 = !{!500}
!505 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "__exe_env", scope: !508, file: !513, line: 37, type: !561, isLocal: false, isDefinition: true)
!508 = distinct !DICompileUnit(language: DW_LANG_C89, file: !509, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/POSIX/fd_init.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/POSIX")
!510 = !{!506, !511}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !508, file: !513, line: 24, type: !514, isLocal: false, isDefinition: true)
!513 = !DIFile(filename: "runtime/POSIX/fd_init.c", directory: "/home/haoxin/disk-smu/research/klee-ccured")
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !61, line: 74, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 62, size: 832, elements: !516)
!516 = !{!517, !518, !549, !550, !551, !552, !553, !555, !556, !557, !558, !559, !560}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !515, file: !61, line: 63, baseType: !62, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !515, file: !61, line: 64, baseType: !519, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !61, line: 44, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 40, size: 192, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !521, file: !61, line: 41, baseType: !62, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !521, file: !61, line: 42, baseType: !7, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !521, file: !61, line: 43, baseType: !526, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 119, size: 1152, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !541, !546, !547, !548}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !527, file: !103, line: 121, baseType: !106, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !527, file: !103, line: 123, baseType: !91, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !527, file: !103, line: 124, baseType: !110, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !527, file: !103, line: 125, baseType: !112, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !527, file: !103, line: 132, baseType: !114, size: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !527, file: !103, line: 133, baseType: !116, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !527, file: !103, line: 135, baseType: !45, size: 32, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !527, file: !103, line: 136, baseType: !106, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !527, file: !103, line: 137, baseType: !120, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !527, file: !103, line: 143, baseType: !122, size: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !527, file: !103, line: 144, baseType: !540, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 168, baseType: !81)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !527, file: !103, line: 152, baseType: !542, size: 128, offset: 576)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 9, size: 128, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !542, file: !127, line: 11, baseType: !130, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !542, file: !127, line: 12, baseType: !132, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !527, file: !103, line: 153, baseType: !542, size: 128, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !527, file: !103, line: 154, baseType: !542, size: 128, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !527, file: !103, line: 164, baseType: !136, size: 192, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !515, file: !61, line: 64, baseType: !519, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !515, file: !61, line: 65, baseType: !62, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !515, file: !61, line: 66, baseType: !519, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !515, file: !61, line: 69, baseType: !62, size: 32, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !515, file: !61, line: 72, baseType: !554, size: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !515, file: !61, line: 72, baseType: !554, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !515, file: !61, line: 72, baseType: !554, size: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !515, file: !61, line: 72, baseType: !554, size: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !515, file: !61, line: 72, baseType: !554, size: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !515, file: !61, line: 73, baseType: !554, size: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !515, file: !61, line: 73, baseType: !554, size: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !61, line: 89, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 81, size: 6272, elements: !563)
!563 = !{!564, !575, !576, !577}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !562, file: !61, line: 82, baseType: !565, size: 6144)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 6144, elements: !573)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !61, line: 60, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 53, size: 192, elements: !568)
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !567, file: !61, line: 54, baseType: !45, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !567, file: !61, line: 55, baseType: !62, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !567, file: !61, line: 58, baseType: !82, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !567, file: !61, line: 59, baseType: !519, size: 64, offset: 128)
!573 = !{!574}
!574 = !DISubrange(count: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !562, file: !61, line: 83, baseType: !161, size: 32, offset: 6144)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !562, file: !61, line: 84, baseType: !62, size: 32, offset: 6176)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !562, file: !61, line: 88, baseType: !45, size: 32, offset: 6208)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !580, file: !585, line: 20149, type: !739, isLocal: false, isDefinition: true)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !582, nameTableKind: None)
!581 = !DIFile(filename: "./extra/locale/locale_data.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!582 = !{!578, !583}
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !580, file: !585, line: 11, type: !586, isLocal: true, isDefinition: true)
!585 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !588, line: 91, baseType: !589)
!588 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 31, size: 2047232, elements: !590)
!590 = !{!591, !595, !599, !603, !607, !611, !615, !619, !623, !627, !631, !635, !639, !656, !660, !662, !664, !668, !670, !674, !678, !682, !686, !690, !694, !698, !702, !706, !710, !714, !715, !719, !723, !727, !731, !735}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !589, file: !588, line: 37, baseType: !592, size: 3360)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 3360, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 420)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !589, file: !588, line: 38, baseType: !596, size: 4032, offset: 3360)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 4032, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 504)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !589, file: !588, line: 40, baseType: !600, size: 28160, offset: 7392)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 28160, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 1760)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !589, file: !588, line: 41, baseType: !604, size: 36224, offset: 35552)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 36224, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 4528)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !589, file: !588, line: 46, baseType: !608, size: 28832, offset: 71776)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 28832, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 3604)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !589, file: !588, line: 47, baseType: !612, size: 13440, offset: 100608)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 13440, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 1680)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !589, file: !588, line: 48, baseType: !616, size: 3136, offset: 114048)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 3136, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 196)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !589, file: !588, line: 53, baseType: !620, size: 408, offset: 117184)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 408, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 51)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !589, file: !588, line: 54, baseType: !624, size: 224, offset: 117592)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 224, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 28)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !589, file: !588, line: 55, baseType: !628, size: 13168, offset: 117816)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 13168, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 1646)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !589, file: !588, line: 56, baseType: !632, size: 226824, offset: 130984)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 226824, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 28353)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !589, file: !588, line: 58, baseType: !636, size: 14432, offset: 357808)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 14432, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 1804)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !589, file: !588, line: 62, baseType: !640, size: 15824, offset: 372240)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 15824, elements: !654)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !643, line: 21, baseType: !644)
!643 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !643, line: 16, size: 688, elements: !645)
!645 = !{!646, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !644, file: !643, line: 17, baseType: !647, size: 128)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !430)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !644, file: !643, line: 18, baseType: !647, size: 128, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !644, file: !643, line: 19, baseType: !647, size: 128, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !644, file: !643, line: 20, baseType: !651, size: 304, offset: 384)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 304, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 38)
!654 = !{!655}
!655 = !DISubrange(count: 23)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !589, file: !588, line: 65, baseType: !657, size: 160, offset: 388064)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 160, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 20)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !589, file: !588, line: 65, baseType: !661, size: 160, offset: 388224)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 160, elements: !277)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !589, file: !588, line: 65, baseType: !663, size: 320, offset: 388384)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 320, elements: !658)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !589, file: !588, line: 66, baseType: !665, size: 360, offset: 388704)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 360, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 45)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !589, file: !588, line: 66, baseType: !669, size: 48, offset: 389072)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 48, elements: !137)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !589, file: !588, line: 66, baseType: !671, size: 240, offset: 389120)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 240, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 15)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !589, file: !588, line: 67, baseType: !675, size: 31152, offset: 389360)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 31152, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 3894)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !589, file: !588, line: 67, baseType: !679, size: 352, offset: 420512)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 352, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 22)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !589, file: !588, line: 67, baseType: !683, size: 6512, offset: 420864)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 6512, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 407)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !589, file: !588, line: 68, baseType: !687, size: 66000, offset: 427376)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 66000, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 8250)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !589, file: !588, line: 68, baseType: !691, size: 800, offset: 493376)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 800, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 50)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !589, file: !588, line: 68, baseType: !695, size: 54864, offset: 494176)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 54864, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 3429)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !589, file: !588, line: 70, baseType: !699, size: 2976, offset: 549040)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2976, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 372)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !589, file: !588, line: 70, baseType: !703, size: 64, offset: 552016)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 64, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 4)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !589, file: !588, line: 70, baseType: !707, size: 3200, offset: 552080)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 3200, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 200)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !589, file: !588, line: 72, baseType: !711, size: 1458256, offset: 555280)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1458256, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 91141)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !589, file: !588, line: 74, baseType: !272, size: 48, offset: 2013536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !589, file: !588, line: 75, baseType: !716, size: 1536, offset: 2013632)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 24)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !589, file: !588, line: 80, baseType: !720, size: 22608, offset: 2015168)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 22608, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 2826)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !589, file: !588, line: 81, baseType: !724, size: 6680, offset: 2037776)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 6680, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 835)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !589, file: !588, line: 82, baseType: !728, size: 144, offset: 2044456)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 144, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 18)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !589, file: !588, line: 85, baseType: !732, size: 552, offset: 2044600)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 552, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 69)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !589, file: !588, line: 87, baseType: !736, size: 2040, offset: 2045152)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2040, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 255)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !742, file: !747, line: 471, type: !748, isLocal: false, isDefinition: true)
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !744, nameTableKind: None)
!743 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!744 = !{!740, !745}
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !742, file: !747, line: 862, type: !243, isLocal: false, isDefinition: true)
!747 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 6144, elements: !258)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !751, file: !747, line: 878, type: !756, isLocal: false, isDefinition: true)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !753, nameTableKind: None)
!752 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!753 = !{!749, !754}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !751, file: !747, line: 981, type: !250, isLocal: false, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 6144, elements: !258)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !759, file: !747, line: 1000, type: !756, isLocal: false, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !761, nameTableKind: None)
!760 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!761 = !{!757, !762}
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !759, file: !747, line: 1103, type: !250, isLocal: false, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "errno", scope: !766, file: !767, line: 7, type: !45, isLocal: false, isDefinition: true)
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !768, nameTableKind: None)
!767 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!768 = !{!764, !769}
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "h_errno", scope: !766, file: !767, line: 8, type: !45, isLocal: false, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "static_fd", scope: !773, file: !774, line: 39, type: !45, isLocal: true, isDefinition: true)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !775, globals: !812, nameTableKind: None)
!774 = !DIFile(filename: "libc/misc/utmp/utent.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!775 = !{!6, !776, !779, !7}
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !777, line: 88, baseType: !778)
!777 = !DIFile(filename: "./include/sys/types.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !248, line: 145, baseType: !81)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmp", file: !781, line: 60, size: 3200, elements: !782)
!781 = !DIFile(filename: "./include/bits/utmp.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!782 = !{!783, !784, !787, !789, !791, !792, !793, !798, !799, !807, !810}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !780, file: !781, line: 62, baseType: !254, size: 16)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !780, file: !781, line: 63, baseType: !785, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !777, line: 100, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !248, line: 147, baseType: !45)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !780, file: !781, line: 64, baseType: !788, size: 256, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !573)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !780, file: !781, line: 65, baseType: !790, size: 32, offset: 320)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !780, file: !781, line: 66, baseType: !788, size: 256, offset: 352)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !780, file: !781, line: 67, baseType: !98, size: 2048, offset: 608)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !780, file: !781, line: 68, baseType: !794, size: 32, offset: 2656)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exit_status", file: !781, line: 52, size: 32, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !794, file: !781, line: 54, baseType: !254, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !794, file: !781, line: 55, baseType: !254, size: 16, offset: 16)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !780, file: !781, line: 81, baseType: !81, size: 64, offset: 2688)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !780, file: !781, line: 82, baseType: !800, size: 128, offset: 2752)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !801, line: 73, size: 128, elements: !802)
!801 = !DIFile(filename: "./include/bits/time.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!802 = !{!803, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !800, file: !801, line: 75, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !248, line: 153, baseType: !81)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !800, file: !801, line: 76, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !248, line: 155, baseType: !81)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !780, file: !781, line: 85, baseType: !808, size: 128, offset: 2880)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 128, elements: !704)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 41, baseType: !45)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !780, file: !781, line: 86, baseType: !811, size: 160, offset: 3008)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !658)
!812 = !{!771, !813, !815, !817}
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "static_utmp", scope: !773, file: !774, line: 40, type: !780, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "static_ut_name", scope: !773, file: !774, line: 42, type: !29, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "default_file_name", scope: !773, file: !774, line: 41, type: !819, isLocal: true, isDefinition: true)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 112, elements: !265)
!820 = distinct !DICompileUnit(language: DW_LANG_C89, file: !821, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !822, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/POSIX/fd_32.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/POSIX")
!822 = !{!823, !824, !7, !832, !147}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !83, line: 86, baseType: !120)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !826)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !825, file: !88, line: 39, baseType: !91, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !825, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !825, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !825, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !825, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !88, line: 22, size: 2240, elements: !834)
!834 = !{!835, !836, !837, !838, !839}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !833, file: !88, line: 25, baseType: !108, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !833, file: !88, line: 26, baseType: !120, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !833, file: !88, line: 31, baseType: !94, size: 16, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !833, file: !88, line: 32, baseType: !96, size: 8, offset: 144)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !833, file: !88, line: 33, baseType: !98, size: 2048, offset: 152)
!840 = distinct !DICompileUnit(language: DW_LANG_C89, file: !841, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !842, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/POSIX/klee_init_env.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/POSIX")
!842 = !{!37}
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!844 = !DIFile(filename: "libc/misc/internals/__errno_location.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!846 = !DIFile(filename: "libc/misc/internals/__h_errno_location.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!848 = !DIFile(filename: "libc/string/memcpy.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !851, nameTableKind: None)
!850 = !DIFile(filename: "libc/string/memset.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__string_uchar_t", file: !854, line: 27, baseType: !96)
!854 = !DIFile(filename: "libc/string/_string.h", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !857, nameTableKind: None)
!856 = !DIFile(filename: "libc/string/strrchr.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!857 = !{!8, !7}
!858 = distinct !DICompileUnit(language: DW_LANG_C89, file: !859, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !894, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/POSIX/stubs.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/POSIX")
!860 = !{!861, !867, !873}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 52, baseType: !62, size: 32, elements: !863)
!862 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/waitflags.h", directory: "")
!863 = !{!864, !865, !866}
!864 = !DIEnumerator(name: "P_ALL", value: 0, isUnsigned: true)
!865 = !DIEnumerator(name: "P_PID", value: 1, isUnsigned: true)
!866 = !DIEnumerator(name: "P_PGID", value: 2, isUnsigned: true)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__priority_which", file: !868, line: 187, baseType: !62, size: 32, elements: !869)
!868 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "")
!869 = !{!870, !871, !872}
!870 = !DIEnumerator(name: "PRIO_PROCESS", value: 0, isUnsigned: true)
!871 = !DIEnumerator(name: "PRIO_PGRP", value: 1, isUnsigned: true)
!872 = !DIEnumerator(name: "PRIO_USER", value: 2, isUnsigned: true)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !868, line: 31, baseType: !62, size: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!875 = !DIEnumerator(name: "RLIMIT_CPU", value: 0, isUnsigned: true)
!876 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1, isUnsigned: true)
!877 = !DIEnumerator(name: "RLIMIT_DATA", value: 2, isUnsigned: true)
!878 = !DIEnumerator(name: "RLIMIT_STACK", value: 3, isUnsigned: true)
!879 = !DIEnumerator(name: "RLIMIT_CORE", value: 4, isUnsigned: true)
!880 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5, isUnsigned: true)
!881 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7, isUnsigned: true)
!882 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7, isUnsigned: true)
!883 = !DIEnumerator(name: "RLIMIT_AS", value: 9, isUnsigned: true)
!884 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6, isUnsigned: true)
!885 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8, isUnsigned: true)
!886 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10, isUnsigned: true)
!887 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11, isUnsigned: true)
!888 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12, isUnsigned: true)
!889 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13, isUnsigned: true)
!890 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14, isUnsigned: true)
!891 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15, isUnsigned: true)
!892 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16, isUnsigned: true)
!893 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16, isUnsigned: true)
!894 = !{!895, !62, !898, !6}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !897, line: 194, flags: DIFlagFwdDecl)
!897 = !DIFile(filename: "runtime/POSIX/stubs.c", directory: "/home/haoxin/disk-smu/research/klee-ccured")
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !83, line: 60, baseType: !106)
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !901, nameTableKind: None)
!900 = !DIFile(filename: "libc/misc/locale/__locale_mbrtowc_l.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!901 = !{!96}
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!903 = !DIFile(filename: "libc/signal/raise.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!905 = !DIFile(filename: "libc/signal/sigaction.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !908, nameTableKind: None)
!907 = !DIFile(filename: "libc/signal/sigsetops.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!908 = !{!10}
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!910 = !DIFile(filename: "libc/stdio/_wcommit.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!912 = !DIFile(filename: "libc/string/strlen.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!914 = !DIFile(filename: "libc/termios/isatty.c", directory: "/home/haoxin/disk-smu/research/klee-env/klee-uclibc")
!915 = distinct !DICompileUnit(language: DW_LANG_C89, file: !916, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !917, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/Intrinsic/klee_range.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/Intrinsic")
!917 = !{!62}
!918 = distinct !DICompileUnit(language: DW_LANG_C89, file: !919, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !920, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "/home/haoxin/disk-smu/research/klee-ccured/runtime/POSIX/fd_64.c", directory: "/home/haoxin/disk-smu/research/klee-ccured/build/runtime/POSIX")
!920 = !{!921, !943}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 119, size: 1152, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !940, !941, !942}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !922, file: !103, line: 121, baseType: !106, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !922, file: !103, line: 123, baseType: !91, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !922, file: !103, line: 124, baseType: !110, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !922, file: !103, line: 125, baseType: !112, size: 32, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !922, file: !103, line: 132, baseType: !114, size: 32, offset: 224)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !922, file: !103, line: 133, baseType: !116, size: 32, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !922, file: !103, line: 135, baseType: !45, size: 32, offset: 288)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !922, file: !103, line: 136, baseType: !106, size: 64, offset: 320)
